benchmarks/results/20260804-154353/inline-c200.txt
Running 10s test @ http://127.0.0.1:8080/
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.37ms   12.47ms 328.55ms   98.51%
    Req/Sec    43.68k    11.71k   64.98k    69.17%
  Latency Distribution
     50%  538.00us
     75%    1.61ms
     90%    3.66ms
     99%   29.77ms
  1740890 requests in 10.07s, 207.53MB read
Requests/sec: 172850.23
Transfer/sec:     20.61MB