benchmarks/results/20260804-154353/large-file-c200.txt
Running 10s test @ http://127.0.0.1:8080/benchmark-large.bin
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   357.97ms  331.99ms   2.05s    85.57%
    Req/Sec   128.91     66.42   310.00     64.10%
  Latency Distribution
     50%  231.07ms
     75%  487.12ms
     90%  811.67ms
     99%    1.54s 
  4739 requests in 10.11s, 37.40GB read
Requests/sec:    468.56
Transfer/sec:      3.70GB